list = [1,1,1,4,4,4,6,6 ,6,7]

list.append(9) # Добавляє елемент

print(list)

list.remove(0) # Видаляє елемент по назві

list.pop(-1) # Видаляє елемент по індексу

list.clear() # Видаляє всі елементи

list.pop()

list.sort() # Сортує у збільшення

list.reverse() # перевертає список

list.extend() # Додає всі елементи з одного списку до іншого або розширює список

new-list = list.copy() # Копіює список

my-list =  list.count() # Повертає кількість елементів

list.insert(0,56) # Добавляє елемент в список